#Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
print(int('F', 16))