# Выведите все элементы, которые меньше определенного числа
a = [1, 2, 4, 3, 5, 6, 34, 23, 65, 34, 76, 7, 2, 13, 24, 12, 11, 15, 3, 22, 26, 21, 22, 25, 27, 32, 66, 88, 9, 43, 56]
b = []
for i in a:
    if i < 34:
        b.append(i)

print(b)
